In [2]:
#Import Dependencies
import pandas as pd
from sqlalchemy import create_engine, inspect

In [ ]:
#Read in CSVs

In [4]:
USAT_file = 'USAT_Data.csv'
USAT = pd.read_csv(USAT_file)
USAT.head()

,Rank,First_Name,Last_Name,Sex,Age,State,Time,Race,Race.1
0,1,Michael,Alexander,M,53,FL,01:02:29.000,87.912,Bartow Blarney Triathlon
1,2,Mark,Hulbert,M,54,FL,01:04:06.000,85.695,Bartow Blarney Triathlon
2,3,Brian,Durden,M,35,FL,01:05:30.000,83.863,Bartow Blarney Triathlon
3,4,Rodney,Carter,M,42,FL,01:05:54.000,83.354,Bartow Blarney Triathlon
4,5,James,Hooppaw,M,27,FL,01:06:10.000,83.018,Bartow Blarney Triathlon

In [6]:
NSGA_file = 'NSGAdatapn.csv'
NSGA = pd.read_csv(NSGA_file)
NSGA.head()

   Unnamed: 0     First      Last State          Time  gender    age  Rank
0           0      Dave  CAMPBELL    CA  01:09:09.000    Male  60-64     1
1           1   Derrill     STEPP    CA  01:10:31.000    Male  55-59     2
2           2      Ross    REMBAC    AZ  01:11:19.000    Male  50-54     3
3           3   Vanessa      COOK    NV  01:11:54.000  Female  50-54     4
4           4     Louis   SALAZAR    NM  01:12:30.000    Male  55-59     5

In [ ]:
#Make the CSVs similar to reach other - in this case the USAT data needs to 
#drop the points column (currently labelled race)

In [2]:
#Connect to Database
connect_string = 'postgresql://postgres:ashari63@35.202.87.202/ETL'
engine = create_engine(connect_string)
conn = engine.connect()

In [3]:
#Drop tables if they already exist
engine.execute("drop table if exists organization; drop table if exists state; drop table if exists race; drop table if exists result;")

In [4]:
#Check that the tables are dropped 
inspector = inspect(engine)
inspector.get_table_names()

[]